## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_shield_protection.alb_qrcode will be created
  + resource "aws_shield_protection" "alb_qrcode" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "alb_qrcode"
      + resource_arn = "arn:aws:elasticloadbalancing:ca-central-1:595701125956:loadbalancer/app/qrcode/c33f21bbbe1577f8"
      + tags_all     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
    ecs_cluster                  = {
        arn                                = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        capacity_providers                 = [
            "FARGATE",
        ]
        configuration                      = []
        default_capacity_provider_strategy = [
            {
                base              = 2
                capacity_provider = "FARGATE"
                weight            = 1
            },
        ]
        id                                 = "arn:aws:ecs:ca-central-1:595701125956:cluster/covid-portal_staging"
        name                               = "covid-portal_staging"
        setting                            = [
            {
                name  = "containerInsights"
                value = "enabled"
            },
        ]
        tags                               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all                           = {
            "CostCentre" = "CovidPortal_Staging"
        }
    }
    security_group_egress        = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-006789af77a3fbdcb"
        description            = "Egress - CovidShield External Services"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal New Relic egress"
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = "Security group rule for Portal email egress"
                from_port        = 587
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 587
            },
        ]
        id                     = "sg-006789af77a3fbdcb"
        ingress                = []
        name                   = "egress-anywhere"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }
    security_group_load_balancer = {
        arn                    = "arn:aws:ec2:ca-central-1:595701125956:security-group/sg-0ddadcce9ea825a8e"
        description            = "Ingress - covidportal Load Balancer"
        egress                 = [
            {
                cidr_blocks      = [
                    "172.16.0.0/16",
                ]
                description      = ""
                from_port        = 8000
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 8000
            },
        ]
        id                     = "sg-0ddadcce9ea825a8e"
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 443
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 443
            },
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 80
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 80
            },
        ]
        name                   = "covidportal-load-balancer"
        name_prefix            = ""
        owner_id               = "595701125956"
        revoke_rules_on_delete = false
        tags                   = {
            "CostCentre" = "CovidPortal_Staging"
        }
        tags_all               = {
            "CostCentre" = "CovidPortal_Staging"
        }
        timeouts               = null
        vpc_id                 = "vpc-0e71ff594dff0ef9d"
    }

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>